In [1]:
import numpy as np
import pandas as pd

from numpy.random import randn

In [3]:
np.random.seed(101)
ser1=pd.Series([1,2,3,4,5],index=['usa','china','india','pak','bang'])

In [4]:
ser1

usa      1
china    2
india    3
pak      4
bang     5
dtype: int64

In [15]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  1.025760 -1.178122 -0.801582 -0.392212
B  0.705642 -0.102694  0.249780  0.676957
C -1.019650  0.411796 -0.012272  1.008062
D  0.224316  2.363038  0.208403 -0.044159
E  0.029642  0.864772  2.061831  0.596997

In [18]:
df['W']

A    1.025760
B    0.705642
C   -1.019650
D    0.224316
E    0.029642
Name: W, dtype: float64

In [20]:
df[['W','Z']]

          W         Z
A  1.025760 -0.392212
B  0.705642  0.676957
C -1.019650  1.008062
D  0.224316 -0.044159
E  0.029642  0.596997

In [21]:
# Adding column to df

df['new']=df['Y']+df['Z']
df

          W         X         Y         Z       new
A  1.025760 -1.178122 -0.801582 -0.392212 -1.193794
B  0.705642 -0.102694  0.249780  0.676957  0.926737
C -1.019650  0.411796 -0.012272  1.008062  0.995790
D  0.224316  2.363038  0.208403 -0.044159  0.164244
E  0.029642  0.864772  2.061831  0.596997  2.658827

In [24]:
# Deleting column


df.drop('new',axis=1)

          W         X         Y         Z
A  1.025760 -1.178122 -0.801582 -0.392212
B  0.705642 -0.102694  0.249780  0.676957
C -1.019650  0.411796 -0.012272  1.008062
D  0.224316  2.363038  0.208403 -0.044159
E  0.029642  0.864772  2.061831  0.596997

In [26]:
# By default drop is not inplace operation

df

          W         X         Y         Z       new
A  1.025760 -1.178122 -0.801582 -0.392212 -1.193794
B  0.705642 -0.102694  0.249780  0.676957  0.926737
C -1.019650  0.411796 -0.012272  1.008062  0.995790
D  0.224316  2.363038  0.208403 -0.044159  0.164244
E  0.029642  0.864772  2.061831  0.596997  2.658827

In [27]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  1.025760 -1.178122 -0.801582 -0.392212
B  0.705642 -0.102694  0.249780  0.676957
C -1.019650  0.411796 -0.012272  1.008062
D  0.224316  2.363038  0.208403 -0.044159
E  0.029642  0.864772  2.061831  0.596997

#  Accessing row data in DF

In [31]:
df.loc['A']

W    1.025760
X   -1.178122
Y   -0.801582
Z   -0.392212
Name: A, dtype: float64

In [33]:
type(df.loc['A'])

pandas.core.series.Series

In [40]:
# based on index
df.iloc[1]

          W         X         Y         Z
A  1.025760 -1.178122 -0.801582 -0.392212
B  0.705642 -0.102694  0.249780  0.676957
C -1.019650  0.411796 -0.012272  1.008062
D  0.224316  2.363038  0.208403 -0.044159
E  0.029642  0.864772  2.061831  0.596997

In [41]:
df

          W         X         Y         Z
A  1.025760 -1.178122 -0.801582 -0.392212
B  0.705642 -0.102694  0.249780  0.676957
C -1.019650  0.411796 -0.012272  1.008062
D  0.224316  2.363038  0.208403 -0.044159
E  0.029642  0.864772  2.061831  0.596997

In [42]:
# Subset of df
df.loc['B','X']

-0.10269373214669585

In [44]:
df.loc[['B','C'],['X','Y']]

          X         Y
B -0.102694  0.249780
C  0.411796 -0.012272

#  Conditional subset

In [47]:
df[df>0]

          W         X         Y         Z
A  1.025760       NaN       NaN       NaN
B  0.705642       NaN  0.249780  0.676957
C       NaN  0.411796       NaN  1.008062
D  0.224316  2.363038  0.208403       NaN
E  0.029642  0.864772  2.061831  0.596997

In [53]:
df[df['W']>0][['X','Y']]

          X         Y
A -1.178122 -0.801582
B -0.102694  0.249780
D  2.363038  0.208403
E  0.864772  2.061831

In [60]:
# Multiple conditions with & operator


df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.029642  0.864772  2.061831  0.596997

# Multiple Index

In [63]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [65]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [67]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [68]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [70]:
df.loc['G1'].loc[1]

A    2.706850
B    0.628133
Name: 1, dtype: float64

In [71]:
df.loc['G1'].loc[1]['A']

2.706849839399938

In [79]:
# Cross sections accesing from index
df.index.names=['Name','Num']

In [80]:
df

                 A         B
Name Num
G1   1    2.706850  0.628133
     2    0.907969  0.503826
     3    0.651118 -0.319318
G2   1   -0.848077  0.605965
     2   -2.018168  0.740122
     3    0.528813 -0.589001

In [83]:
df.xs(1,level='Num')

             A         B
Name
G1    2.706850  0.628133
G2   -0.848077  0.605965

# Missing data in DF

In [85]:
d={'A':[1,2,np.NAN],'B':[2,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [86]:
df.dropna()

     A    B  C
0  1.0  2.0  1

In [90]:
df.dropna(thresh=1)

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [91]:
# Fill the values
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#  Group by in pandas

In [92]:
d={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
   'Person':['Sam','Charlie','Alec','Ram','Sham','Duce'],
  'Sales':[123,300,400,200,40,60]}

In [93]:
d

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Alec', 'Ram', 'Sham', 'Duce'],
 'Sales': [123, 300, 400, 200, 40, 60]}

In [96]:
df=pd.DataFrame(d)
df

  Company   Person  Sales
0    GOOG      Sam    123
1    GOOG  Charlie    300
2    MSFT     Alec    400
3    MSFT      Ram    200
4      FB     Sham     40
5      FB     Duce     60

In [97]:
byComp=df.groupby('Company')

In [98]:
byComp.sum()

         Sales
Company
FB         100
GOOG       423
MSFT       600

In [99]:
 byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0   50.0   14.142136   40.0   45.00   50.0   55.00   60.0
GOOG      2.0  211.5  125.157900  123.0  167.25  211.5  255.75  300.0
MSFT      2.0  300.0  141.421356  200.0  250.00  300.0  350.00  400.0

#  Merging concatenating & joining DF

In [100]:
df1=pd.DataFrame(
{'A':['A0','A1','A2','A3'],
 'B':['B0','B1','B2','B3'],
 'C':['C0','C1','C2','C3'],
 'D':['D0','D1','D2','D3']
},
    index=[0,1,2,3]
)

In [101]:
df2=pd.DataFrame(
{'A':['A4','A5','A6','A7'],
 'B':['B4','B5','B6','B7'],
 'C':['C4','C5','C6','C7'],
 'D':['D4','D5','D6','D7']
},
    index=[4,5,6,7]
)

In [102]:
df3=pd.DataFrame(
{'A':['A8','A9','A10','A11'],
 'B':['B8','B9','B10','B11'],
 'C':['C8','C9','C10','C11'],
 'D':['D8','D9','D10','D11']
},
    index=[8,9,10,11]
)

In [105]:
# Concating based on rows
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
# Concatenating based in column
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [108]:
    left=pd.DataFrame({
        'A':['A0','A1','A2','A3'],
        'B':['B0','B1','B2','B3'],
        'key':['k0','k1','k2','k3']
    })

In [109]:
right=pd.DataFrame({
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3'],
    'key':['k0','k1','k2','k3']
})

In [111]:
# Merge
pd.merge(left,right)

    A   B key   C   D
0  A0  B0  k0  C0  D0
1  A1  B1  k1  C1  D1
2  A2  B2  k2  C2  D2
3  A3  B3  k3  C3  D3

In [112]:
#  has multiple options how you want to merege using "on"

In [115]:
# Join is working on indexes of data frames
df1=pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3']
},index=['k0','k1','k2','k3'])

df2=pd.DataFrame({
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']
},index=['k0','k1','k2','k3'])

In [116]:
df1.join(df2)

     A   B   C   D
k0  A0  B0  C0  D0
k1  A1  B1  C1  D1
k2  A2  B2  C2  D2
k3  A3  B3  C3  D3

In [118]:

d={'col1':[1,2,3,4],
    'col2':[444,555,666,77],
  'col3':['abc','def','gh','jk']}

df=pd.DataFrame(d)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666   gh
3     4    77   jk

In [1]:
# apply function

df['col1'].apply(lambda x:x*2)

NameError: name 'df' is not defined

# Data input output

In [ ]:
data=pd.read_html('https://www1.nseindia.com/products/content/derivatives/equities/historical_fo.htm')
data.head()

In [2]:
data=pd.read_html('https://www1.nseindia.com/live_market/dynaContent/live_watch/option_chain/optionKeys.jsp?symbolCode=-9999&symbol=BANKNIFTY&symbol=BANKNIFTY&instrument=OPTIDX&date=-&segmentLink=17&segmentLink=17')
data

TimeoutError: [Errno 60] Operation timed out